<div class="alert alert-success" role="alert">
		<strong>Well done!</strong> You successfully read this important alert message.
</div>
<p>Тут будем думать, как должно быть.</p>
<p>Очевидно, список статей.</p>
<p>Список разделов - тоже.</p>
<p>Таблицу для статей тащим с сл, сео-теги из дэцэ. Объединить поля в одну таблицу.</p>
<p>При нажатии на редактировать - не хочется модал, пусть лучше открывается типа таба с формой.
Посмотреть, реально ли это сделать с помощью бутстрап, ничего более не подключая. Если это отдельный плагин - значит пилить на вью и сравнить выходной размер с вью и с бут-плагином</p>
<p>В случае с бутстрап три таба - Статьи, Новая, Сео-теги. В идеале Статьи и Новая, а Сео-теги появляются при выборе Новая</p>

<p></p>
<p></p>
