window.langRu = {
	'hWaitLabel' : 'Пожалуйста подождите...',
	'hOtherVersions' : 'Другие варианты',
	'hYouNowUse' : 'Вы сейчас используете',
	'hAboutScreen' : '<p>\
					Здесь вы можете выбрать наиболее подходящий вам режим работы WebUSB.\
					WebUSB пытается сама выбрать наиболее оптимальный режим, в заисимости от вашего устройства.\
					Это почти всегда работает автоматически, но не всегда.\
				</p>\
				<p>Если WebUSB работает не так, как это ожидалось, прочтите описания версий и выберите нужную.</p>\
				<p>Версии разрабатывались для дефолтных браузеров соответствующих операционных систем.</p>',
	'hVersA2Title' : 'Версия для смартфонов с ОС Android 2',
	'hVersA2Dsc' : '<p>Самая первая и самая часто используемая версия. WebUSB была создана, когда я понял,\
									что не могу загружать файлы в облако из смартфона под управлением android 2, \
									потому что популярные сервисы перестали поддерживать эту систему.\
									Если вы почему-то решили воспользоваться смартфоном с android 2, \
									используйте эту версию для доступа к вашим файлам в интернете.\
								</p>\
								<p>\
									Предусмотрен малый размер экранов некоторых смартфонов с OC Android 2.\
									Меню приложения вызывается нажатием клавиши \
									"Назад" <img src="./i/b.jpg"> устройства. \
									Если же вам действительно хочется уйти туда, окуда вы пришли в WebUSB, надо выбрать \
									"Опции" -&gt; "Выйти из WebUSB".\
								</p>\
								<p>\
									Так как JavaScript дефолтный браузер android 2 ещё не знал, что такое FormData,\
									эта версия аплоадит файлы без шкалы прогресса.\
									Если у вас более современный смартфон, не стоит её использовать.\
								</p>\
								<p>\
									Версия проверена и отлично работает на устройствах \
									Samsung Galaxy Young GT-S5363, \
									Samsung Galaxy Trend GT S7390,\
									Fly Stratus 7, \
									Xiaomi Redmi Note 7,\
									iPhone 11.\
								</p>\
								<p>\
									На Samsung Galaxy Young GT-S6102 возникли проблемы, поэтому для него была создана отдельная версия.\
								</p>',
	'bUTV'   : 'Использовать эту версию',
	'bUTV1'  : 'Использовать эту версию',
	'bUTV2'  : 'Использовать эту версию',
	'bUTV3'  : 'Использовать эту версию',
	'bUTV4'  : 'Использовать эту версию',
	'bUTV5'  : 'Использовать эту версию',
	'bUTVPC' : 'Использовать эту версию',
	'hVersS6102Title' : 'Специальная версия для Samsung Galaxy Young GT-S6102',
	'hVersS6102Dsc' : '<p>Внезапно выяснилось, что устройство Galaxy Young GT-S6102 имеет особенности.\
									Не исключено, что дело было в поломке конкретного устройства, которое попало в мои руки.\
									Но тем не менее, была создана специальная версия для этого устройства.\
								</p>\
								<p>\
									Используйте эту версию, если \
									<a href="#a2">основная версия для смартфонов с OC Android 2</a>\
									работает не так, как ожидалось.\
								</p>\
								<p>\
									Версия проверена и отлично работает на устройствах \
									Samsung Galaxy Young GT-S5363, \
									Samsung Galaxy Young GT-S6102,\
									Samsung Galaxy Trend GT S7390,\
									Fly Stratus 7, \
									Xiaomi Redmi Note 7,\
									iPhone 11.\
								</p>',
	'hVersA4Title' : 'Версия для смартфонов с ОС Android 4 и выше',
	'hVersA4Dsc' : '<p>Появилась тупо потому, что хотелось шкалу прогресса при аплоаде.\
									К тому же на современных смартфонах экраны гораздо более крупные,\
									чем у Samsung Galaxy Young GT-S5363 с которого всё начиналось,\
									а значит в фиче показа меню по кнопке "Назад" <img src="./i/b.jpg"> устройства\
									никакой необходимости более не было.\
								</p>\
								<p>\
									Если ось на смартфоне новее, чем android 2, смело используйте эту версию.\
								</p>\
								<p>\
									Версия проверена и отлично работает на устройствах \
									Samsung Galaxy Trend GT S7390,\
									Fly Stratus 7, \
									Xiaomi Redmi Note 7,\
									iPhone 11.\
								</p>',
	'hVersDesktopTempT' : 'Временная версия для десктопа',
	'hVersDesktopTempDsc' : '<p>Появилась потому, что использовать версию для смартфона на компьютере или ноутбуке было неудобно,\
									а времени писать нормальную версию для десктопа не было.\
								</p>\
								<p>Сейчас уже рекомендую использовать <a href="#pc">предварительную версию для десктопа</a>, но если она у вас не работает, можете попробовать эту.</p>\
								<p>\
									Если хотите загрузить с вашего компьютера файлы, чтобы потом скачать их в смартфон KitKat или, не к ночи будь помянут, Gringerbread, милости просим!\
								</p>\
								<p>\
									Версия проверена и отлично работает на двух ноутбуках и двух компьютерах\
									под управлением ОС Windows и Linux.\
								</p>',
	'hVersDesktopT' : 'Основная версия для десктопа',
	'hVersDesktopDsc' : '<p>Для последних версий десктопных браузеров. <b>Сейчас в разработке!</b>\
								</p>\
								<p>\
									Здесь я впервые отпущу тормоза и буду использовать все возможности современного javascript. Без фреймвёрков, потому что так больше фана.\
								</p>\
								<p>\
									Эта версия будет работать в десктопных браузерах равных или выше чем\
									Firefox 119,\
									Chromium 119.0.6044.159\
								</p>',
	'hVersDesktop2T'   : 'Предварительная версия для десктопа',
	'hVersDesktop2Dsc' : '<p>Для последних версий десктопных (то есть тех, которые в ноутбуках и компьютерах) браузеров. Chrome 131+ или Firefox 133+</p>\
	<p>Работа в других браузерах не гарантируется.</p>\
	<p>Используйте её, если хотите загрузить с вашего компьютера файлы, чтобы потом скачать их в смартфон KitKat или более раннюю.</p>\
	<p>В плане реализации это промежуточная версия между es5 и es6. Хотелось выкинуть всё legacy и написать с нуля на es6, \
	  но у меня есть самописный файловый менеджер для десктопа на javascript es5 и мне захотелось скрестить его код с webUSB и посмотреть, что получится.\
	  То, что получилось мне нравится точно больше, чем <a href="#w">временная версия для десктопа</a>, поэтому я делаю это версией для десктопа по умолчанию.\
	</p>\
	',
	'' : '',
	'' : '',
	'' : '',
	'' : '',
};
