window.langRu = {
	'linkAbout' : 'Войти',
	'hWaitGetLink' : '<div>Сайт использует файлы cookie и аналогичные методы для распознавания посетителей и запоминания предпочтений.</div>\
				<div>Сайт также может использовать их в будущем для измерения эффективности кампании и анализа трафика сайта.</div>\
				<div>Выбирая «Принять», вы соглашаетесь на использование этих методов нами и доверенными третьими лицами.</div>',
	'Click download button' : '<div>Сайт использует файлы cookie и аналогичные методы для распознавания посетителей и запоминания предпочтений.</div>\
				<div>Сайт также может использовать их в будущем для измерения эффективности кампании и анализа трафика сайта.</div>\
				<div>Выбирая «Принять», вы соглашаетесь на использование этих методов нами и доверенными третьими лицами.</div>',
		'' : ''
};
