window.langRu = {
	'linkAbout' : 'Войти',
	'hWaitGetLink' : '<div>Проект WebUSB это ещё несколько гигабайт в облаке для ваших файлов.</div>\
				<div>Ваш смартфон может устареть, но файлы из WebUSB всё равно будут доступны из его дефлтного браузера - в этом идея этого проекта.</div>',
	'You have not access to this page' : 'Вы не имеете право на доступ к этой странице',
	'Click download button' : '<div>Проект WebUSB это ещё несколько гигабайт в облаке для ваших файлов.</div>\
				<div>Ваш смартфон может устареть, но файлы из WebUSB всё равно будут доступны из его дефлтного браузера - в этом идея этого проекта.</div>',
	'' : '',
	'' : '',
		'' : ''
};
